## Basic Data Manipulations with R

### Replacing / Recoding values
* By 'recoding', it means replacing existing value(s) with the new value(s

**Create Dummy Data**

In [1]:
mydata = data.frame(State = ifelse(sign(rnorm(25))==-1,'Delhi','Goa'), Q1= sample(1:25))

In [2]:
head(mydata)

  State Q1
1 Goa   11
2 Goa    8
3 Delhi  5
4 Delhi  1
5 Delhi 16
6 Delhi 14

**In this example, we are replacing 1 with 6 in Q1 variable**

In [3]:
mydata$Q1[mydata$Q1==1] <- 6

In [5]:
head(mydata)

  State Q1
1 Goa   11
2 Goa    8
3 Delhi  5
4 Delhi  6
5 Delhi 16
6 Delhi 14

**In this example, we are replacing "Delhi" with "Mumbai" in State variable. We need to convert the variable from factor to character.**

In [6]:
mydata$State = as.character(mydata$State)
mydata$State[mydata$State=='Delhi'] <- 'Mumbai'

In [7]:
mydata

   State  Q1
1  Goa    11
2  Goa     8
3  Mumbai  5
4  Mumbai  6
5  Mumbai 16
6  Mumbai 14
7  Goa    23
8  Goa    25
9  Goa    17
10 Goa     3
11 Mumbai 24
12 Goa    15
13 Mumbai 13
14 Mumbai 18
15 Goa    22
16 Goa    12
17 Goa     4
18 Mumbai 19
19 Goa     9
20 Goa     6
21 Goa    20
22 Mumbai 10
23 Mumbai  2
24 Mumbai  7
25 Goa    21

**In this example, we are replacing 2 and 3 with NA values in whole dataset.**

In [8]:
mydata[mydata == 2 | mydata == 3] <- NA

In [9]:
mydata

   State  Q1
1  Goa    11
2  Goa     8
3  Mumbai  5
4  Mumbai  6
5  Mumbai 16
6  Mumbai 14
7  Goa    23
8  Goa    25
9  Goa    17
10 Goa    NA
11 Mumbai 24
12 Goa    15
13 Mumbai 13
14 Mumbai 18
15 Goa    22
16 Goa    12
17 Goa     4
18 Mumbai 19
19 Goa     9
20 Goa     6
21 Goa    20
22 Mumbai 10
23 Mumbai NA
24 Mumbai  7
25 Goa    21

**Another method**

In [ ]:
# You have to first install the car package.
# Install the car package
# install.packages("car", repos = "https://cran.r-project.org/")

In [10]:
# Load the car package
library("car")

# Recode 1 to 6
mydata$Q1 <- recode(mydata$Q1, "1=6")

Installing package into '/home/nbuser/R'
(as 'lib' is unspecified)

In [11]:
mydata

   State  Q1
1  Goa    11
2  Goa     8
3  Mumbai  5
4  Mumbai  6
5  Mumbai 16
6  Mumbai 14
7  Goa    23
8  Goa    25
9  Goa    17
10 Goa    NA
11 Mumbai 24
12 Goa    15
13 Mumbai 13
14 Mumbai 18
15 Goa    22
16 Goa    12
17 Goa     4
18 Mumbai 19
19 Goa     9
20 Goa     6
21 Goa    20
22 Mumbai 10
23 Mumbai NA
24 Mumbai  7
25 Goa    21

**Recoding a given range**

In [12]:
# Recoding 1 through 4 to 0 and 5 and 6 to 1
mydata$Q1 <- recode(mydata$Q1, "1:4=0; 5:6=1")

# You don't need to specify lowest and highest value of a range.
# The lo keyword tells recode to start the range at the lowest value.
# The hi keyword tells recode to end the range at the highest value.

In [13]:
mydata

   State  Q1
1  Goa    11
2  Goa     8
3  Mumbai  1
4  Mumbai  1
5  Mumbai 16
6  Mumbai 14
7  Goa    23
8  Goa    25
9  Goa    17
10 Goa    NA
11 Mumbai 24
12 Goa    15
13 Mumbai 13
14 Mumbai 18
15 Goa    22
16 Goa    12
17 Goa     0
18 Mumbai 19
19 Goa     9
20 Goa     1
21 Goa    20
22 Mumbai 10
23 Mumbai NA
24 Mumbai  7
25 Goa    21

In [14]:
# Recoding lowest value through 4 to 0 and 5 to highest value to 1
mydata$Q1 <- recode(mydata$Q1, "lo:4=0; 5:hi=1")

In [15]:
mydata

   State  Q1
1  Goa     1
2  Goa     1
3  Mumbai  0
4  Mumbai  0
5  Mumbai  1
6  Mumbai  1
7  Goa     1
8  Goa     1
9  Goa     1
10 Goa    NA
11 Mumbai  1
12 Goa     1
13 Mumbai  1
14 Mumbai  1
15 Goa     1
16 Goa     1
17 Goa     0
18 Mumbai  1
19 Goa     1
20 Goa     0
21 Goa     1
22 Mumbai  1
23 Mumbai NA
24 Mumbai  1
25 Goa     1

**You can specify else condition in the recode statement. It means how to treat remaining values that was not already recoded.**

In [16]:
# Recoding lowest value through 4 to 0, 5 and 6 to 1, remaining values to 3,
mydata$Q1 <- recode(mydata$Q1, "lo:4=0; 5:6=1;else = 3")

In [17]:
mydata

   State  Q1
1  Goa    0
2  Goa    0
3  Mumbai 0
4  Mumbai 0
5  Mumbai 0
6  Mumbai 0
7  Goa    0
8  Goa    0
9  Goa    0
10 Goa    3
11 Mumbai 0
12 Goa    0
13 Mumbai 0
14 Mumbai 0
15 Goa    0
16 Goa    0
17 Goa    0
18 Mumbai 0
19 Goa    0
20 Goa    0
21 Goa    0
22 Mumbai 0
23 Mumbai 3
24 Mumbai 0
25 Goa    0

## Recoding to a new column

In [ ]:
# Create a new column called Ques1
mydata$Ques1<- recode(mydata$Q1, "1:4=0; 5:6=1")
# Note : Make sure you have installed and loaded "car" package before running the above syntax.

**How to use IF ELSE Statement**

In [ ]:
# Sample Data
samples = data.frame(x =c(rep(1:10)), y=letters[1:10])

**If a value of variable x is greater than 6, create a new variable called t1 and write 2 against the corresponding values else make it 1.**

In [ ]:
samples$t1 = ifelse(samples$x>6,2,1)

**How to use AND Condition**

In [ ]:
samples$t3 = ifelse(samples$x>1 & samples$y=="b" ,2,1)

**How to use NESTED IF ELSE Statement **

In [ ]:
samples$t4 = ifelse(samples$x>=1 & samples$x<=4,1,ifelse(samples$x>=5 & samples$x<=7,2,3))

## Renaming variables

In [18]:
# To rename variables, you have to first install the dplyr package.

# Install the plyr package
install.packages("dplyr", repos="https://cran.r-project.org/")

Installing package into '/home/nbuser/R'
(as 'lib' is unspecified)

In [19]:
# Load the plyr package
library(dplyr)

# Rename Q1 variable to var1
mydata <- rename(mydata, var1 = Q1)

Attaching package: 'dplyr'

The following object is masked from 'package:car':

    recode

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

## Keeping and Dropping Variables

In [20]:
# In this example, we keep only first two variables .
mydata1 <- mydata[1:2]

In [21]:
mydata1

   State  var1
1  Goa    0
2  Goa    0
3  Mumbai 0
4  Mumbai 0
5  Mumbai 0
6  Mumbai 0
7  Goa    0
8  Goa    0
9  Goa    0
10 Goa    3
11 Mumbai 0
12 Goa    0
13 Mumbai 0
14 Mumbai 0
15 Goa    0
16 Goa    0
17 Goa    0
18 Mumbai 0
19 Goa    0
20 Goa    0
21 Goa    0
22 Mumbai 0
23 Mumbai 3
24 Mumbai 0
25 Goa    0

In [ ]:
# Dropping Q3 variable
mydata$Q3 <- NULL

# Dropping multiple variables by their names
df = subset(mydata, select = -c(x,z) )

## Subset data (Selecting Observations)
* By 'subsetting' data, it implies filtering rows (observations).

In [23]:
# Create Sample Data
mydata = data.frame(Name = ifelse(sign(rnorm(25))==-1,'ABC','DEF'), age = sample(1:25))

In [24]:
mydata

   Name age
1  ABC  20
2  ABC  10
3  ABC  17
4  DEF  25
5  ABC   5
6  DEF  24
7  DEF  15
8  DEF   8
9  DEF   3
10 ABC  13
11 DEF   4
12 ABC  22
13 DEF  11
14 DEF   6
15 ABC  14
16 ABC  16
17 ABC  19
18 ABC  23
19 DEF  12
20 ABC   2
21 DEF  18
22 ABC   7
23 DEF   9
24 ABC   1
25 ABC  21

In [25]:
# Selecting first 10 observations
newdata <- mydata[1:10,]

In [26]:
# Selecting values wherein age is equal to 3
mydata<-subset(mydata, age==3)

In [27]:
mydata

  Name age
9 DEF  3

In [28]:
# Copy data into a new data frame called 'newdata'
newdata<-subset(mydata, age==3)

In [29]:
newdata

  Name age
9 DEF  3

In [30]:
# Conditional Statement (AND) while selecting observations
newdata<-subset(mydata, Name=="ABC" & age==3)

In [31]:
newdata

     Name age

In [34]:
# Conditional Statement (OR) while selecting observations
newdata<-subset(mydata, Name=="ABC" | age==3)

In [35]:
newdata

  Name age
9 DEF  3

In [36]:
# Greater than or less than expression
newdata<-subset(mydata, age>=3)

In [37]:
newdata

  Name age
9 DEF  3

In [38]:
# Keeping only missing records
newdata<-subset(mydata, is.na(age))

In [39]:
newdata

     Name age

In [40]:
# Keeping only non-missing records
newdata<-subset(mydata, !is.na(age))

In [41]:
newdata

  Name age
9 DEF  3

## Sorting
* Sorting is one of the most common data manipulation task. It is generally used when we want to see the top 5 highest / lowest values of a variable.

In [42]:
# Sorting a vector
x= sample(1:50)
x = sort(x, decreasing = TRUE)

In [43]:
x

 [1] 50 49 48 47 46 45 44 43 42 41 40 39 38 37 36 35 34 33 32 31 30 29 28 27 26
[26] 25 24 23 22 21 20 19 18 17 16 15 14 13 12 11 10  9  8  7  6  5  4  3  2  1

In [44]:
# The function sort() is used for sorting a 1 dimensional vector. It cannot be used for more than 1 dimensional vector.
# Sorting a data frame
mydata = data.frame(Gender = ifelse(sign(rnorm(25))==-1,'F','M'), SAT= sample(1:25))

In [45]:
mydata

   Gender SAT
1  F      17
2  F       1
3  M       2
4  F      20
5  M       4
6  F      24
7  F       3
8  F      15
9  M      25
10 M      14
11 M       9
12 F      21
13 M      13
14 F      12
15 F       6
16 M      10
17 M      11
18 M      19
19 F      18
20 M       8
21 M      16
22 M       5
23 M      23
24 F       7
25 F      22

In [46]:
# Sort gender variable in ascending order
mydata.sorted <- mydata[order(mydata$Gender),]

In [47]:
mydata.sorted

   Gender SAT
1  F      17
2  F       1
4  F      20
6  F      24
7  F       3
8  F      15
12 F      21
14 F      12
15 F       6
19 F      18
24 F       7
25 F      22
3  M       2
5  M       4
9  M      25
10 M      14
11 M       9
13 M      13
16 M      10
17 M      11
18 M      19
20 M       8
21 M      16
22 M       5
23 M      23

In [48]:
# Sort gender variable in ascending order and then SAT in descending order
mydata.sorted1 <- mydata[order(mydata$Gender, -mydata$SAT),]
# Note : "-" sign before mydata$SAT tells R to sort SAT variable in descending order.

In [49]:
mydata.sorted1

   Gender SAT
6  F      24
25 F      22
12 F      21
4  F      20
19 F      18
1  F      17
8  F      15
14 F      12
24 F       7
15 F       6
7  F       3
2  F       1
9  M      25
23 M      23
18 M      19
21 M      16
10 M      14
13 M      13
17 M      11
16 M      10
11 M       9
20 M       8
22 M       5
5  M       4
3  M       2

## Dealing with missing data

In [58]:
# Number of missing values in a variable
colSums(is.na(mydata))
# Number of missing values in a row
rowSums(is.na(mydata))
# List rows of data that have missing values
mydata[!complete.cases(mydata),]
# Creating a new dataset without missing data
mydata1 <- na.omit(mydata)
# Convert a value to missing
mydata[mydata$Q1==999,"Q1"] <- NA

y x
0 0

[1] 0 0 0

     y x

## Aggregate by groups

In [53]:
# The following code calculates mean for variable "x" by grouped variable "y".
samples = data.frame(x =c(rep(1:10)), y=round((rnorm(10))))
mydata <- aggregate(x~y, samples, mean, na.rm = TRUE)

In [54]:
mydata

  y  x
1 -1 4.333333
2  0 6.833333
3  1 1.000000

## data Manipulation with dplyr package

In [ ]:
https://goo.gl/86GHeL

## data Manipulation with data.table package

In [ ]:
https://goo.gl/B8njyV

## Running SQL queries using sqldf package

In [61]:
# Install and Load Package
install.packages("sqldf", repos="https://cran.r-project.org")

Installing package into '/home/nbuser/R'
(as 'lib' is unspecified)

In [62]:
library(sqldf)

In [63]:
# Create sample data
dt <- data.frame( ID = c('X1','X2','X4','X2','X1','X4','X3','X2','X1','X3'),
  Value = c(4,3,1,3,4,6,6,1,8,4))

In [65]:
dt

   ID Value
1  X1 4
2  X2 3
3  X4 1
4  X2 3
5  X1 4
6  X4 6
7  X3 6
8  X2 1
9  X1 8
10 X3 4

**Example 1 : Select first 3 rows**

In [66]:
x = sqldf("select * from dt limit 3")

ERROR: Error in parse(text = x, srcfile = src): <text>:1:1: unexpected '^'
1: **
    ^

**Example 2 : Handle dot (.) in Column and Table names **

In [ ]:
# Put the names in double quotes
test <- data.frame( x.1 = 1:10 )
sqldf( 'SELECT "x.1" FROM test' )
test.2 = data.frame(x= sample(10))
sqldf( 'SELECT * FROM "test.2" ' )

**Example 3 : Subset rows **

In [ ]:
x2 = sqldf("select * from dt where Value >= 4")

**Example 4 : Concatenate two data frames **

In [ ]:
x3 = sqldf("select * from x union all select * from x2")

**Example 5 : Create a new variable**

In [ ]:
x4 = sqldf("select *, value*2 as newval from dt ")

**Example 6 : Merge with another table**

In [67]:
dt2 <- data.frame( ID = c('A1','A2','A4','A2','A1','A4','A3','A2','A1','A3'),
                  ColID = c('Saving',
                            'Current',
                            'Loan',
                            'Current',
                            'Saving',
                            'Loan',
                            'Mortgage',
                            'Current',
                            'Saving',
                            'Mortgage')) 
x5 = sqldf("select a.*,b.ColID from dt a left join (select distinct ID, ColID from  dt2) b
           on a.ID = b.ID")

In [68]:
x5

   ID Value ColID
1  X1 4     NA
2  X2 3     NA
3  X4 1     NA
4  X2 3     NA
5  X1 4     NA
6  X4 6     NA
7  X3 6     NA
8  X2 1     NA
9  X1 8     NA
10 X3 4     NA